{
  "metadata": {
    "title": "Ask Me (beta) - Engineering Leader AI Assistant",
    "description": "Chat with my AI assistant."
  },
  "navigation": {
    "back_link": "Engineering Leader",
    "page_title": "Ask Me (beta)"
  },
  "chat": {
    "welcome_message": "Hello! I'm a baby bot. I am learning. I can help you with keyword based search on this website",
    "input_placeholder": "Ask me anything about Soumitra",
    "send_button": "Send",
    "typing_indicator": "Typing...",
    "beta_notice": "This is a beta feature. Some responses are simulated for demonstration purposes."
  },
  "responses": {
    "context_aware": {
      "introduction": {
        "keywords": ["Soumitra", "Ghosh", "website"],
        "response": "This website showcases my career graph. I plan to add more information in the coming days."
      },
      "team_leadership": {
        "keywords": ["team", "leadership", "manage"],
        "response": "Great question about team leadership! I've found that successful engineering teams thrive on three key principles: clear communication, psychological safety, and continuous learning. Regular 1:1s, team retrospectives, and setting clear expectations are crucial. What specific leadership challenge are you facing?"
      },
      "technology": {
        "keywords": ["technology", "tech", "stack"],
        "response": "Technology decisions should always align with business objectives and team capabilities. I recommend evaluating based on: scalability, maintainability, team expertise, and long-term support. What's the primary goal you're trying to achieve with your technology choices?"
      },
      "cloud": {
        "keywords": ["cloud", "aws", "azure", "gcp"],
        "response": "Cloud-native approaches can significantly improve scalability and deployment velocity. I've successfully migrated teams to cloud platforms, and the key is starting small with non-critical services. Are you currently using any specific cloud platforms, and what's your team's cloud experience level?"
      },
      "devops": {
        "keywords": ["devops", "ci/cd", "pipeline"],
        "response": "DevOps practices are crucial for modern engineering teams. I've implemented CI/CD pipelines that reduced deployment time from hours to minutes. Start with automated testing, then build deployment pipelines. What's your current deployment process like?"
      },
      "scaling": {
        "keywords": ["scaling", "growth", "hire"],
        "response": "Team scaling requires careful attention to both technical architecture and human dynamics. I've grown teams from 5 to 50+ engineers. Key factors: clear career paths, mentorship programs, and maintaining team culture. How large is your current team, and what growth challenges are you facing?"
      },
      "architecture": {
        "keywords": ["architecture", "design", "system"],
        "response": "System architecture decisions have long-term implications. I've architected systems that handle millions of users. Focus on: scalability, maintainability, and team productivity. What kind of system are you designing, and what are your primary concerns?"
      },
      "agile": {
        "keywords": ["agile", "scrum", "sprint"],
        "response": "Agile methodologies work best when adapted to your team's needs. I've seen teams succeed with various approaches - the key is consistency and continuous improvement. What's your current process, and what challenges are you experiencing?"
      },
      "development": {
        "keywords": ["code", "development", "programming"],
        "response": "Development practices evolve constantly. I've led teams through major technology transitions. Focus on: code quality, automated testing, and knowledge sharing. What specific development challenges are you facing?"
      }
    },
    "default": [
      "That's an interesting question! Based on my experience with engineering leadership, I'd recommend focusing on clear communication and setting measurable goals. What specific aspect would you like to explore further?",
      "I've found that successful engineering teams often thrive on a balance of autonomy and structure. Have you considered implementing regular retrospectives to gather team feedback?",
      "I'd be happy to share more specific insights about that topic. Could you provide a bit more context about your situation?",
      "That's a great question that many engineering leaders face. What's the primary goal you're trying to achieve with this approach?",
      "I've encountered similar challenges in my experience. What specific obstacles are you currently facing?"
    ]
  },
  "ui": {
    "loading_delay": {
      "min": 1500,
      "max": 1000
    },
    "messages": {
      "user_avatar_alt": "User",
      "assistant_avatar_alt": "AI Assistant"
    }
  }
} 